# PANDAS

- Pandas is an open source, BSD - Licensed library providing high performance,easy-to-use-data structure and data analysis tools

#### Agenda
- What are DataFrames?
- What are DataSeries?
- Different Operations in Pandas

In [4]:
# Importing Libraries
import pandas as pd
import numpy as np

#### Data frames are a combination of both rows and columns and it will show us a representation format where in how your data exactly looks like in the excel sheet, in the same way it will be loaded.

In [30]:
# Playing with Data frames
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['Column1','Column2','Column3','Column4'])

In [31]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [32]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [33]:
df.shape

(5, 4)

In [34]:
# converting it into an excel sheet
df.to_csv('Test1.csv')

In [35]:
# Accessing the Elements
# There are 2 ways (LOC and ILOC)

In [36]:
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [37]:
type(df.loc['Row1'])

pandas.core.series.Series

In [38]:
# Data frames are the combination of rows and columns more than 1 column and 1 row
# Data Series can either be one row or either one column
#We consider it as series

In [39]:
df.iloc[:,1:3]

      Column2  Column3
Row1        1        2
Row2        5        6
Row3        9       10
Row4       13       14
Row5       17       18

In [40]:
type(df.iloc[:,1:3])

pandas.core.frame.DataFrame

In [42]:
df.iloc[:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [50]:
# Converting the Dataframes into array
# This is a two dimentional array

df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [51]:
df.iloc[:,1:].values.shape

(5, 3)

In [54]:
# we should be familiar with how to check the null  condition
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [56]:
df['Column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: Column1, dtype: int64

In [58]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])

In [63]:
type(['Column2','Column4'])

list

In [65]:
df[['Column2','Column4']]

      Column2  Column4
Row1        1        3
Row2        5        7
Row3        9       11
Row4       13       15
Row5       17       19